Lugi55/FB_V1/HB_V1.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32G4
ProjectManager.MainLocation=Core/Src
NVIC.ADC1_2_IRQn=true\:0\:0\:false\:true\:true\:1\:true\:true
HRTIM1.CompareValue1-Output_TE1TE2=0
ADC2.ExternalTrigConv=ADC_EXTERNALTRIG_HRTIM_TRG1
RCC.USART1Freq_Value=85000000
RCC.SAI1Freq_Value=170000000
RCC.CortexFreq_Value=170000000
HRTIM1.SetOutput1_Source1-Output_TE1TE2=HRTIM_OUTPUTSET_TIMPER
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32G474RETx
Dma.USART1_TX.0.RequestNumber=1
USART1.BaudRate=921600
Dma.USART1_TX.0.SignalID=NONE
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-MX_DMA_Init-DMA-false-HAL-true,3-SystemClock_Config-RCC-false-HAL-false,4-MX_HRTIM1_Init-HRTIM1-false-HAL-true,5-MX_USART1_UART_Init-USART1-false-HAL-true,6-MX_ADC1_Init-ADC1-false-HAL-true,7-MX_TIM2_Init-TIM2-false-HAL-true
PC9.Locked=true
RCC.USART2Freq_Value=170000000
PC5.Mode=Asynchronous
USART1.IPParameters=VirtualMode-Asynchronous,BaudRate
PC13.GPIO_Label=LED3
PC1.Locked=true
PinOutPanel.RotationAngle=0
HRTIM1.ResetOutput1_Source1-Output_TE1TE2=HRTIM_OUTPUTRESET_TIMCMP2
RCC.MCO1PinFreq_Value=16000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x400
RCC.I2C3Freq_Value=170000000
RCC.LPTIM1Freq_Value=170000000
Mcu.IP4=NVIC
Mcu.IP5=RCC
RCC.FCLKCortexFreq_Value=170000000
Mcu.IP2=DMA
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP3=HRTIM1
PB4.GPIOParameters=GPIO_Label
Mcu.IP0=ADC1
ADC2.Rank-13\#ChannelRegularConversion=1
Mcu.IP1=ADC2
Dma.USART1_TX.0.Priority=DMA_PRIORITY_LOW
HRTIM1.NumberSetSource1-Output_TE1TE2=1
Mcu.UserConstants=DEADTIME,50;PERIOD_100,54400;BLANKING,100;MAX_PERIOD,40800
Dma.USART1_TX.0.Direction=DMA_MEMORY_TO_PERIPH
Dma.USART1_TX.0.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
HRTIM1.ResetOutput1_Source2-Output_TE1TE2=HRTIM_OUTPUTRESET_TIMCMP1
Mcu.ThirdPartyNb=0
HRTIM1.ADCTrigger3_Source1=HRTIM_ADCTRIGGEREVENT13_TIMERE_CMP3
ADC1.Channel-3\#ChannelRegularConversion=ADC_CHANNEL_6
RCC.HCLKFreq_Value=170000000
RCC.I2C4Freq_Value=170000000
Mcu.IPNb=9
TIM2.IPParameters=ClockDivision,PeriodNoDither,TIM_MasterOutputTrigger
ProjectManager.PreviousToolchain=
RCC.APB2TimFreq_Value=170000000
TIM2.ClockDivision=TIM_CLOCKDIVISION_DIV4
Mcu.Pin6=PC9
Mcu.Pin7=PC11
VP_TIM2_VS_ClockSourceINT.Signal=TIM2_VS_ClockSourceINT
Mcu.Pin8=PB4
Mcu.Pin9=VP_SYS_VS_Systick
RCC.AHBFreq_Value=170000000
Mcu.Pin0=PC13
Mcu.Pin1=PC0
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PC1
Mcu.Pin3=PC4
RCC.USART3Freq_Value=170000000
Mcu.Pin4=PC5
Mcu.Pin5=PC8
ProjectManager.ProjectBuild=false
RCC.HSE_VALUE=8000000
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
RCC.ADC12Freq_Value=170000000
HRTIM1.CompareUnit3-Output_TE1TE2=HRTIM_COMPAREUNIT_3
ProjectManager.FirmwarePackage=STM32Cube FW_G4 V1.4.0
MxDb.Version=DB.6.0.21
TIM2.PeriodNoDither=4250000
ProjectManager.BackupPrevious=false
HRTIM1.GreaterCMP3_TE=HRTIM_TIMERGTCMP3_EQUAL
RCC.VCOInputFreq_Value=4000000
PC11.GPIO_Label=tg1
NVIC.TIM2_IRQn=true\:0\:0\:false\:false\:true\:true\:true
File.Version=6
HRTIM1.NumberResetSource1-Output_TE1TE2=2
PC9.Mode=Output_TE1TE2
PC11.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
VP_SYS_VS_DBSignals.Mode=DisableDeadBatterySignals
Dma.USART1_TX.0.SyncRequestNumber=1
RCC.PLLRCLKFreq_Value=170000000
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Dma.USART1_TX.0.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
Dma.RequestsNb=1
ProjectManager.HalAssertFull=false
RCC.CRSFreq_Value=48000000
ProjectManager.ProjectName=HB_V1
Mcu.Package=LQFP64
HRTIM1.FallingValue-Output_TE1TE2=DEADTIME
ADC1.OversamplingMode=DISABLE
ProjectManager.ToolChainLocation=
RCC.LSI_VALUE=32000
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
HRTIM1.CompareValue3-Output_TE1TE2=BLANKING
RCC.LSCOPinFreq_Value=32000
HRTIM1.CompareUnit1-Output_TE1TE2=HRTIM_COMPAREUNIT_1
Dma.USART1_TX.0.Instance=DMA1_Channel1
HRTIM1.ADCTrigger1_Source1=HRTIM_ADCTRIGGEREVENT13_TIMERE_CMP3
HRTIM1.NumberADCTriggerSource1=1
TIM2.TIM_MasterOutputTrigger=TIM_TRGO_ENABLE
RCC.APB2CLKDivider=RCC_HCLK_DIV2
RCC.PLLPoutputFreq_Value=170000000
HRTIM1.NumberADCTriggerSource3=1
HRTIM1.CompareUnit2-Output_TE1TE2=HRTIM_COMPAREUNIT_2
RCC.APB1TimFreq_Value=170000000
Dma.USART1_TX.0.EventEnable=DISABLE
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
RCC.LPUART1Freq_Value=170000000
PC5.Signal=USART1_RX
HRTIM1.CompareValue2-Output_TE1TE2=MAX_PERIOD
NVIC.USART1_IRQn=true\:0\:0\:false\:false\:true\:true\:true
Dma.Request0=USART1_TX
ProjectManager.CustomerFirmwarePackage=
HRTIM1.NumberResetSource2_TE=0
PC4.Mode=Asynchronous
RCC.HSI48_VALUE=48000000
PB4.Signal=GPIO_Output
Dma.USART1_TX.0.SyncSignalID=NONE
RCC.I2SFreq_Value=170000000
RCC.PLLQoutputFreq_Value=170000000
HRTIM1.RisingValue-Output_TE1TE2=DEADTIME
ProjectManager.ProjectFileName=HB_V1.ioc
HRTIM1.ResetOutput2_Source1-Output_TE1TE2=HRTIM_OUTPUTRESET_TIMCMP1
Dma.USART1_TX.0.MemInc=DMA_MINC_ENABLE
Dma.USART1_TX.0.PeriphInc=DMA_PINC_DISABLE
Mcu.PinsNb=12
HRTIM1.CompareUnit4-Output_TE1TE2=__NULL
ProjectManager.NoMain=false
PC11.Locked=true
ADC1.IPParameters=master,OversamplingMode,EnableRegularConversion,Rank-3\#ChannelRegularConversion,Channel-3\#ChannelRegularConversion,SamplingTime-3\#ChannelRegularConversion,OffsetNumber-3\#ChannelRegularConversion,NbrOfConversionFlag,ExternalTrigConv
PC13.Locked=true
PC13.Signal=GPIO_Output
PC11.Signal=GPIO_Output
ADC1.OffsetNumber-3\#ChannelRegularConversion=ADC_OFFSET_NONE
PC8.Signal=HRTIM1_CHE1
PC4.Signal=USART1_TX
RCC.EXTERNAL_CLOCK_VALUE=12288000
ProjectManager.DefaultFWLocation=true
ADC2.SamplingTime-13\#ChannelRegularConversion=ADC_SAMPLETIME_2CYCLES_5
ProjectManager.DeletePrevious=true
Dma.USART1_TX.0.Polarity=HAL_DMAMUX_REQ_GEN_RISING
PC0.Signal=ADC1_IN6
PC11.GPIOParameters=GPIO_Speed,PinState,GPIO_Label
RCC.QSPIFreq_Value=170000000
RCC.FamilyName=M
HRTIM1.SetOutput2_Source1-Output_TE1TE2=HRTIM_OUTPUTSET_TIMCMP1
PC0.Mode=IN6-Single-Ended
USART1.VirtualMode-Asynchronous=VM_ASYNC
ProjectManager.TargetToolchain=STM32CubeIDE
HRTIM1.postscaler1=24
Dma.USART1_TX.0.SyncEnable=DISABLE
ADC2.IPParameters=Rank-13\#ChannelRegularConversion,Channel-13\#ChannelRegularConversion,SamplingTime-13\#ChannelRegularConversion,OffsetNumber-13\#ChannelRegularConversion,NbrOfConversionFlag,ExternalTrigConv
HRTIM1.Polarity2-Output_TE1TE2=HRTIM_OUTPUTPOLARITY_HIGH
Dma.USART1_TX.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
ProjectManager.RegisterCallBack=
RCC.USBFreq_Value=170000000
RCC.LSE_VALUE=32768
HRTIM1.ADCTrigger_Id1=HRTIM_ADCTRIGGER_1
HRTIM1.ADCTrigger_Id3=__NULL
Dma.USART1_TX.0.Mode=DMA_NORMAL
board=custom
RCC.VCOOutputFreq_Value=340000000
ProjectManager.LastFirmware=true
RCC.ADC345Freq_Value=170000000
RCC.APB2Freq_Value=85000000
RCC.UART4Freq_Value=170000000
PC11.PinState=GPIO_PIN_RESET
MxCube.Version=6.2.1
PB4.GPIO_Label=LED4
VP_TIM2_VS_ClockSourceINT.Mode=Internal
RCC.I2C1Freq_Value=170000000
VP_SYS_VS_DBSignals.Signal=SYS_VS_DBSignals
PC13.GPIOParameters=GPIO_Label
RCC.FDCANFreq_Value=170000000
RCC.RNGFreq_Value=170000000
VP_SYS_VS_Systick.Mode=SysTick
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
RCC.UART5Freq_Value=170000000
ProjectManager.FreePins=false
ADC2.OffsetNumber-13\#ChannelRegularConversion=ADC_OFFSET_NONE
RCC.IPParameters=ADC12Freq_Value,ADC345Freq_Value,AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,APB2CLKDivider,APB2Freq_Value,APB2TimFreq_Value,CRSFreq_Value,CortexFreq_Value,EXTERNAL_CLOCK_VALUE,FCLKCortexFreq_Value,FDCANFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI48_VALUE,HSI_VALUE,I2C1Freq_Value,I2C2Freq_Value,I2C3Freq_Value,I2C4Freq_Value,I2SFreq_Value,LPTIM1Freq_Value,LPUART1Freq_Value,LSCOPinFreq_Value,LSE_VALUE,LSI_VALUE,MCO1PinFreq_Value,PLLM,PLLN,PLLPoutputFreq_Value,PLLQoutputFreq_Value,PLLRCLKFreq_Value,PWRFreq_Value,QSPIFreq_Value,RNGFreq_Value,SAI1Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,UART4Freq_Value,UART5Freq_Value,USART1Freq_Value,USART2Freq_Value,USART3Freq_Value,USBFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32G474R(B-C-E)Tx
ProjectManager.UnderRoot=true
Mcu.IP8=USART1
ADC1.ExternalTrigConv=ADC_EXTERNALTRIG_HRTIM_TRG1
Mcu.IP6=SYS
PC8.Mode=Output_TE1TE2
Mcu.IP7=TIM2
ProjectManager.CoupleFile=true
PB4.Locked=true
RCC.SYSCLKFreq_VALUE=170000000
ADC1.master=1
ADC1.Rank-3\#ChannelRegularConversion=1
ADC1.SamplingTime-3\#ChannelRegularConversion=ADC_SAMPLETIME_2CYCLES_5
ADC2.NbrOfConversionFlag=1
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.CompilerOptimize=6
Dma.USART1_TX.0.MemDataAlignment=DMA_MDATAALIGN_BYTE
ProjectManager.HeapSize=0x200
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.ComputerToolchain=false
RCC.HSI_VALUE=16000000
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
ADC1.NbrOfConversionFlag=1
Mcu.Pin11=VP_TIM2_VS_ClockSourceINT
RCC.PLLM=RCC_PLLM_DIV4
RCC.PLLN=85
Mcu.Pin10=VP_SYS_VS_DBSignals
ADC1.EnableRegularConversion=ENABLE
RCC.PWRFreq_Value=170000000
PC8.Locked=true
PC9.Signal=HRTIM1_CHE2
ADC2.Channel-13\#ChannelRegularConversion=ADC_CHANNEL_7
NVIC.DMA1_Channel1_IRQn=true\:0\:0\:false\:false\:true\:false\:true
RCC.I2C2Freq_Value=170000000
HRTIM1.DeadTimeInsertion-Output_TE1TE2=HRTIM_TIMDEADTIMEINSERTION_ENABLED
RCC.APB1Freq_Value=170000000
ProjectManager.DeviceId=STM32G474RETx
PC1.Signal=ADC2_IN7
HRTIM1.Periode_TE=PERIOD_100
ProjectManager.LibraryCopy=1
PC1.Mode=IN7-Single-Ended
HRTIM1.IPParameters=Periode_TE,CompareUnit1-Output_TE1TE2,NumberSetSource1-Output_TE1TE2,NumberResetSource1-Output_TE1TE2,SetOutput1_Source1-Output_TE1TE2,ResetOutput1_Source1-Output_TE1TE2,NumberResetSource2_TE,Polarity2-Output_TE1TE2,SetOutput2_Source1-Output_TE1TE2,ResetOutput2_Source1-Output_TE1TE2,ADCTrigger_Id1,NumberADCTriggerSource1,postscaler1,ADCTrigger1_Source1,DeadTimeInsertion-Output_TE1TE2,RisingValue-Output_TE1TE2,FallingValue-Output_TE1TE2,CompareUnit2-Output_TE1TE2,CompareValue2-Output_TE1TE2,CompareUnit3-Output_TE1TE2,CompareValue3-Output_TE1TE2,ADCTrigger_Id3,NumberADCTriggerSource3,ADCTrigger3_Source1,GreaterCMP3_TE,CompareValue1-Output_TE1TE2,CompareUnit4-Output_TE1TE2,ResetOutput1_Source2-Output_TE1TE2
isbadioc=false
